In [22]:
import pandas as pd

df = pd.read_csv("../dataset/raw_data.csv")
df.head()

,customer_id,name,email,age,city,join_date,last_purchase,total_spent
0,C001,Andi,andigmail.com,23,Jakarta,2023-01-15,2023-04-20,1500000
1,C002,NaN,budi@example.com,NaN,Bandung,2023/02/01,2023/05/10,?
2,C003,Siti,NaN,27,NaN,2023-03-05,2023-05-18,250000
3,C004,NaN,rani@example.com,?,Surabaya,2023/01/20,NaN,300000
4,C005,Joko,joko@example.com,31,?,2023-02-10,2023-03-22,1200000

In [23]:
df.isna().sum()

customer_id      0
name             3
email            2
age              3
city             2
join_date        1
last_purchase    1
total_spent      1
dtype: int64

In [24]:
(df.isna().sum() / len(df)) * 100

customer_id       0.0
name             30.0
email            20.0
age              30.0
city             20.0
join_date        10.0
last_purchase    10.0
total_spent      10.0
dtype: float64